Repository: NeriQuest/ExpenseMate-App-translations
Catalog: l10n/app_*.arb
Languages: kn, ml, ta, te

source: Home
kn: ಮುಖಪುಟ
ml: ഹോം
ta: முகப்பு
te: హోమ్

source: Add
kn: ಸೇರಿಸಿ
ml: ചേർക്കുക
ta: சேர்க்கவும்
te: చేరించండి

source: Stats
kn: ಅಂಕಿಅಂಶಗಳು
ml: സ്ഥിതിവിവരം
ta: புள்ளிவிவரங்கள்
te: గణాంకాలు

source: Current Month Expense
kn: ಪ್ರಸ್ತುತ ತಿಂಗಳ ವೆಚ್ಚ
ml: ഇപ്പോഴത്തെ മാസ ചെലവ്
ta: தற்போதைய மாத செலவுகள்
te: ప్రస్తుత నెల ఖర్చు

source: Accent Color
kn: ಆಕ್ಸೆಂಟ್ ಬಣ್ಣ
ml: ആക്സന്റ് നിറം
ta: அசெண்ட் நிறம்
te: ఉప రంగు

source: Theme Mode
kn: ಥೀಮ್ ಮೋಡ್
ml: തീം മോഡ്
ta: தீம் முறை
te: థీమ్ మోడ్

source: Edit Dashboard
kn: ಡ್ಯಾಶ್ಬೋರ್ಡ್ ಸಂಪಾದಿಸಿ
ml: ഡാഷ്ബോർഡ് എഡിറ്റ് ചെയ്യുക
ta: டாஷ்போர்டை திருத்துக
te: డాష్బోర్డ్ సవరించండి

source: Notification
kn: ಅಧಿಸೂಚನೆ
ml: അറിയിപ്പ്
ta: அறிவிப்பு
te: నోటిఫికేషన్

source: Biometric Lock
kn: ಬಯೋಮೆಟ್ರಿಕ್ ಲಾಕ್
ml: ബയോമെട്രിക് ലോക്ക്
ta: உயிர்முறை பூட்டு
te: బయోమెట్రిక్ లాక్

source: Language
kn: ಭಾಷೆ
ml: ഭാഷ
ta: மொழி
te: భాష

source: Primary Currency
kn: ಪ್ರಾಥಮಿಕ ಕರೆನ್ಸಿ
ml: പ്രാഥമിക കറൻസി
ta: முதன்மை நாணயம்
te: ప్రధాన కరెన్సీ

source: Settings
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ml: ക്രമീകരണങ്ങൾ
ta: அமைப்புகள்
te: సెట్టింగ్స్

source: Select an accent color for this app
kn: ಈ ಅಪ್ಲಿಕೇಶನ್‌ಗಾಗಿ ಆಕ್ಸೆಂಟ್ ಬಣ್ಣವನ್ನು ಆಯ್ಕೆಮಾಡಿ
ml: ഈ ആപ്പിനായി ഒരു ആക്സന്റ് നിറം തിരഞ്ഞെടുക്കുക
ta: இந்த பயன்பாட்டிற்கு ஒரு அசெண்ட் நிறத்தைத் தேர்ந்தெடுக்கவும்
te: ఈ యాప్ కోసం ఒక ఉప రంగును ఎంచుకోండి

source: Select an app theme
kn: ಅಪ್ಲಿಕೇಶನ್ ಥೀಮ್ ಆಯ್ಕೆಮಾಡಿ
ml: ആപ്പ് തീം തിരഞ്ഞെടുക്കുക
ta: பயன்பாட்டு தீமைக் க்கு தேர்வுசெய்க
te: యాప్ థీమ్ ఎంచుకోండి

source: Select and rearrange dashboard
kn: ಡ್ಯಾಶ್ಬೋರ್ಡ್ ಅನ್ನು ಆಯ್ಕೆಮಾಡಿ ಮತ್ತು ಮರುಕ್ರಮಗೊಳಿಸಿ
ml: ഡാഷ്ബോർഡ് തിരഞ്ഞെടുക്കുക മ്ക് പുനഃക്രമീകരിക്കുക
ta: டாஷ்போர்டைத் தேர்வு செய்து மறுவரிசை செய்யவும்
te: డాష్బోర్డ్ ఎంచుకుని పునఃక్రమీకరించండి

source: Set reminder for adding transaction
kn: ವ್ಯವಹಾರವನ್ನು ಸೇರಿಸಲು ಸ್ಮರಣೆ ಹೊಂದಿಸಿ
ml: ഇടപാട് ചേർക്കുന്നതിന് ഓർമ്മപ്പെടുത്തൽ സജ്ജമാക്കുക
ta: பரிவர்த்தனையைச் சேர்க்க நினைவூட்டல் அமைக்கவும்
te: లావాదేవీని జోడించడానికి రిమైండర్ సెట్ చేయండి

source: Be secure
kn: ಸುರಕ್ಷಿತವಾಗಿರಿ
ml: സുരക്ഷിതമായി
ta: பாதுகாப்பாக இரு
te: సురక్షితంగా ఉండండి

source: Choose your preferred language
kn: ನೀವು ಇಷ್ಟಪಡುವ ಭಾಷೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
ml: നിങ്ങളുടെ ഇഷ്ട ഭാഷ തിരഞ്ഞെടുക്കുക
ta: உங்களுக்குப் பிடித்த மொழியைத் தேர்ந்தெடுக்கவும்
te: మీ ఇష్టమైన భాషను ఎంచుకోండి

source: Select your currency
kn: ನಿಮ್ಮ ಕರೆನ್ಸಿಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
ml: നിങ്ങളുടെ കറൻസി തിരഞ്ഞെടുക്കുക
ta: உங்கள் நாணயத்தைத் தேர்ந்தெடுக்கவும்
te: మీ కరెన్సీని ఎంచుకోండి

source: Hue
kn: ವರ್ಣ
ml: നിറം
ta: வண்ணம்
te: వర్ణం

source: Saturation
kn: ಸಂತೃಪ್ತಿ
ml: പക്വത
ta: நிறைவுத்தன்மை
te: పుష్టి

source: Brightness
kn: ಪ್ರಕಾಶ
ml: പ്രകാശം
ta: பிரகாசம்
te: కాంతి

# enter_hex_value
source: Enter a Hex value
kn: Hex ಮೌಲ್ಯವನ್ನು ನಮೂದಿಸಿ
ml: Hex മൂല്യം നൽകുക
ta: Hex மதிப்பை உள்ளிடுக
te: Hex విలువను నమోదు చేయండి

source: Light Theme
kn: ಲೈಟ್ ಥೀಮ್
ml: ലൈറ്റ് തീം
ta: லைட் தீம்
te: లైట్ థీమ్

source: Dark Theme
kn: ಡಾರ್ಕ್ ಥೀಮ್
ml: ഡാർക്ക് തീം
ta: டார்க் தீம்
te: డార్క్ థీమ్

source: System Default
kn: ಸಿಸ್ಟಮ್ ಡೀಫಾಲ್ಟ್
ml: സിസ്റ്റം ഡിഫോൾട്ട്
ta: சிஸ்டம் டிஃபால்ட்
te: సిస్టమ్ డిఫాల్ట్

source: Daily Reminder
kn: ದಿನದಿನದ ಜ್ಞಾಪನೆ
ml: ദൈനംദിന ഓർമപ്പെടുത്തൽ
ta: தினசரி நினைவூட்டல்
te: రోజువారీ రిమైండర్

source: Numbering System
kn: ಸಂಖ್ಯಾತ್ಮಕ ವ್ಯವಸ್ಥೆ
ml: സംഖ്യാപന സംവിധാനം
ta: எண்களுக்கான முறை
te: సంఖ్యా వ్యవస్థ

source: American
kn: ಅಮೇರಿಕನ್
ml: അമേരിക്കൻ
ta: அமெரிக்க
te: అమెరికన్

source: British
kn: ಬ್ರಿಟಿಷ್
ml: ബ്രിട്ടീഷ്
ta: பிரிட்டிஷ்
te: బ్రిటిష్

source: Decimal Precision
kn: ದಶಮಲವ ನಿಯತಾಂಕ
ml: ഡെസിമൽ പ്രിസിഷൻ
ta: தசம அலகு
te: దశాంశ సున్నితత్వం

source: Select Currency
kn: ಕರೆನ್ಸಿ ಆಯ್ಕೆಮಾಡಿ
ml: കറൻസി തിരഞ്ഞെടുക്കുക
ta: நாணயத்தை தேர்வுசெய்க
te: కరెన్సీని ఎంచుకోండి

source: You could not be authenticated. Please try again.
kn: ನಿಮ್ಮ ಪರಿಶೀಲನೆ ವಿಫಲವಾಗಿದೆ. ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
ml: നിങ്ങളെ സ്ഥിരീകരിക്കാൻ കഴിഞ്ഞില്ല. ദയവായി വീണ്ടും ശ്രമിക്കുക
ta: உங்களை அங்கீகரிக்க முடியவில்லை. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.
te: మీరు ధృవీకరించబడలేదు. దయచేసి మళ్లీ ప్రయత్నించండి.

source: Authentication Failed
kn: ಅಂಗೀಕಾರ ವಿಫಲವಾಗಿದೆ
ml: പ്രാമാണീകരണം പരാജയപ്പെട്ടു
ta: அங்கீகாரம் தோல்வி
te: ప్రామాణికత విఫలమైంది

source: Name
kn: ಹೆಸರು
ml: പേര്
ta: பெயர்
te: పేరు

source: Ok
kn: ಸರಿ
ml: ശരി
ta: சரி
te: సరే

source: User Guide
kn: ಬಳಕೆದಾರರ ಮಾರ್ಗದರ್ಶಿ
ml: ഉപയോക്തൃ ഗൈഡ്
ta: பயனர் கையேடு
te: వినియోగదారుల మార్గదర్శి

source: Don't miss out any features
kn: ಯಾವುದೇ ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ಮಿಸ್ ಮಾಡದಿರಿ
ml: ഏതെങ്കിലും ഫീച്ചറുകൾ നഷ്ടപ്പെടാതിരിക്കുക
ta: எந்த அம்சத்தையும் தவறவிடாதீர்கள்
te: ఏ లక్షణాన్నీ మిస్ కాకండి

source: Share
kn: ಹಂಚಿಕೊಳ್ಳಿ
ml: പങ്കിടുക
ta: பகிர்
te: పంచుకోండి

source: Invite your Chess friend
kn: ನಿಮ್ಮ ಚೆಸ್ ಸ್ನೇಹಿತನನ್ನು ಆಹ್ವಾನಿಸಿ
ml: നിങ്ങളുടെ ചതുരംഗ സുഹൃത്തിനെ ക്ഷണിക്കുക
ta: உங்கள் சதுரங்க நண்பரை அழைக்கவும்
te: మీ చెస్ ఫ్రెండ్‌ని ఆహ్వానించండి

source: Check out ExpenseMate App in Google PlayStore
kn: ಗೂಗಲ್ ಪ್ಲೇಸ್ಟೋರ್‌ನಲ್ಲಿ ExpenseMate ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಪರೀಕ್ಷಿಸಿ
ml: ഗൂഗിൾ പ്ലേസ്റ്റോറിൽ ExpenseMate ആപ്പ് പരിശോധിക്കുക
ta: கூகிள் பிளேஸ்டோரில் ExpenseMate ஆப் சரிபார்க்கவும்
te: గూగుల్ ప్లేస్టోర్‌లో ExpenseMate యాప్‌ని చెక్ చేయండి

source: Manage Category
kn: ವರ್ಗವನ್ನು ನಿರ್ವಹಿಸಿ
ml: വിഭാഗം കൈകാര്യം ചെയ്യുക
ta: வகையை நிர்வகிக்கவும்
te: వర్గాన్ని నిర్వహించండి

source: Add, delete or reorder category
kn: ವರ್ಗವನ್ನು ಸೇರಿಸಿ, ಅಳಿಸಿ ಅಥವಾ ಪುನ:ವ್ಯವಸ್ಥೆಗೊಳಿಸಿ
ml: വിഭാഗം ചേർക്കുക, മായ്ക്കുക അല്ലെങ്കിൽ വീണ്ടും ക്രമീകരിക്കുക
ta: வகையை சேர்க்கவும், நீக்கவும் அல்லது மீண்டும் வரிசைப்படுத்தவும்
te: వర్గాన్ని జోడించండి, తొలగించండి లేదా పునర్వ్యవస్థీకరించండి

source: Manage Account
kn: ಖಾತೆಯನ್ನು ನಿರ್ವಹಿಸಿ
ml: അക്കൗണ്ട് മാനേജ് ചെയ്യുക
ta: கணக்கை நிர்வகிக்கவும்
te: ఖాతాను నిర్వహించండి

source: Add, delete or reorder Account
kn: ಖಾತೆಯನ್ನು ಸೇರಿಸಿ, ಅಳಿಸಿ ಅಥವಾ ಪುನ:ವ್ಯವಸ್ಥೆಗೊಳಿಸಿ
ml: അക്കൗണ്ട് ചേർക്കുക, മായ്ക്കുക അല്ലെങ്കിൽ വീണ്ടും ക്രമീകരിക്കുക
ta: கணக்கை சேர்க்கவும், நீக்கவும் அல்லது மீண்டும் வரிசைப்படுத்தவும்
te: ఖాతాను జోడించండి, తొలగించండి లేదా పునర్వ్యవస్థీకరించండి

source: Change settings of your choice
kn: ನಿಮ್ಮ ಆಯ್ಕೆಯ ಸೆಟ್ಟಿಂಗ್ಗಳನ್ನು ಬದಲಿಸಿ
ml: നിങ്ങളുടെ ഇഷ്ടാനുസൃതമായി ക്രമീകരണം മാറ്റുക
ta: உங்கள் விருப்பத்தின் அமைப்புகளை மாற்றவும்
te: మీ ఇష్టమైన సెట్టింగులను మార్చండి

source: About
kn: ಬಗ್ಗೆ
ml: കുറിച്ച്
ta: பற்றி
te: గురించి

source: About app and its features
kn: ಅಪ್ಲಿಕೇಶನ್ ಮತ್ತು ಅದರ ವೈಶಿಷ್ಟ್ಯಗಳ ಬಗ್ಗೆ
ml: ആപ്പ് വിശദാംശങ്ങൾ
ta: ஆப் மற்றும் அதன் அம்சங்களைப் பற்றி
te: యాప్ మరియు దాని లక్షణాల గురించి

source: Exit
kn: ನಿರ್ಗಮಿಸಿ
ml: പുറത്തേക്കു പോകുക
ta: வெளியேறு
te: నిష్క్రమించు

source: Exit app without prompt
kn: ಪ್ರಾಂಪ್ಟ್ ಇಲ್ಲದೆ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ನಿರ್ಗಮಿಸಿ
ml: അറിയിപ്പില്ലാതെ ആപ്പിൽ നിന്നും പുറത്തേക്ക് പോകുക
ta: எச்சரிக்கையின்றி ஆப்பை வெளியேறு
te: ప్రాంప్ట్ లేకుండా యాప్ నుండి నిష్క్రమించు

source: Weekly
kn: ವಾರದ
ml: ആഴ്ചക്കത്തെ
ta: வாரம்
te: వారంతో

source: Monthly
kn: ತಿಂಗಳುಗಳ
ml: മാസങ്ങൾക്കുള്ള
ta: மாதம்
te: నెలవారి

source: Month
kn: ತಿಂಗಳು
ml: മാസം
ta: மாதம்
te: నెల

source: Year
kn: ವರ್ಷ
ml: വർഷം
ta: ஆண்டு
te: సంవత్సరం

source: All
kn: ಎಲ್ಲವೂ
ml: എല്ലാം
ta: அனைத்து
te: అన్ని

source: Transaction
kn: ವ್ಯವಹಾರ
ml: ലാഭനഷ്ടം
ta: பரிவர்த்தனை
te: లాభం

source: Income
kn: ಆದಾಯ
ml: വരുമാനം
ta: வருமானம்
te: ఆదాయం

source: Expense
kn: ಖರ್ಚು
ml: ചിലവ്
ta: செலவு
te: ఖర్చు

source: Recent Transactions
kn: ಇತ್ತೀಚಿನ ವ್ಯವಹಾರಗಳು
ml: അടുത്ത ലാഭനഷ്ടങ്ങൾ
ta: சமீபத்திய பரிவர்த்தனைகள்
te: ఇటీవల లాభాలు

source: View All
kn: ಎಲ್ಲವನ್ನೂ ವೀಕ್ಷಿಸಿ
ml: എല്ലാം കാണുക
ta: அனைத்தையும் பார்க்கவும்
te: అన్ని చూడండి

source: Narikodan Hridul
kn: ನರಿಕೊಡನ್ ಹೃದುಲ್
ml: നരിക്കോടന്‍ ഹൃദുല്‍
ta: நரிக்கோடன் ஹிர்டுல்
te: నరికోడన్ హృదుల్

source: Lead Developer
kn: ಮುಖ್ಯ ಅಭಿವೃದ್ಧಿಪರ
ml: പ്രമുഖ ഡെവലപ്പർ
ta: தலைமை வளாகல்
te: లీడ్ డెవలపర్

source: App Version
kn: ಅಪ್ಲಿಕೇಶನ್ ಆವೃತ್ತಿ
ml: ആപ്പ് പതിപ്പ്
ta: செயலி பதிப்பு
te: అప్లికేషన్ వెర్షన్

source: Released On
kn: ಬಿಡುಗಡೆಯಾದ ದಿನಾಂಕ
ml: പുറത്തിറക്കിയത്
ta: வெளியீட்டில்
te: విడుదల చేయబడింది

source: Rate Us
kn: ನಮ್ಮನ್ನು ರೇಟ್ ಮಾಡಿ
ml: ഞങ്ങളെ റേറ്റ് ചെയ്യുക
ta: எங்களை மதிப்பிடுங்கள்
te: మాకు రేట్ ఇవ్వండి

source: Enjoying Expense Mate?
kn: Expense Mate ಆನಂದಿಸುತ್ತಿದ್ದೀರಾ?
ml: Expense Mate ഉപഭോഗിക്കുന്നുണ്ടോ?
ta: Expense Mate மகிழ்ச்சியா?
te: Expense Mate ఆనందిస్తున్నారా?

source: Privacy Policy
kn: ಗೌಪ್ಯತೆ ನಿಯಮಗಳು
ml: സ്വകാര്യതാ നയം
ta: தனியுரிமை கொள்கை
te: గోప్యతా విధానం

source: Your privacy matters
kn: ನಿಮ್ಮ ಗೌಪ್ಯತೆ ಪ್ರಮುಖ
ml: നിങ്ങളുടെ സ്വകാര്യത പ്രസക്തമാക്കുന്നു
ta: உங்கள் தனியுரிமை முக்கியம்
te: మీ గోప్యత ముఖ్యం

# made_in_india_with_love_and_passion
source: Made in India, with love & passion
kn: ಪ್ರೀತಿ ಮತ್ತು ಉತ್ಸಾಹದಿಂದ ಭಾರತದಲ್ಲಿ ನಿರ್ಮಿಸಲಾಗಿದೆ
ml: ഇന്ത്യയിൽ സ്നേഹത്തോടും ഉറവിടങ്ങോടും നിർമ്മിച്ചത്
ta: இந்தியாவில் காதலும் உற்சாகமும் உள்ளது
te: ప్రేమ మరియు ఉత్సాహంతో భారతదేశంలో తయారుచేసారు

source: About Us
kn: ನಮ್ಮ ಬಗ್ಗೆ
ml: ഞങ്ങളെക്കുറിച്ച്
ta: எங்களை பற்றி
te: మా గురించి

source: Save Order
kn: ಆದೇಶ ಉಳಿಸಿ
ml: ഓർഡർ സേവ് ചെയ്യുക
ta: ஆர்டர் சேமி
te: ఆర్డర్ సేవ్ చేయండి

source: Pick Color
kn: ಬಣ್ಣ ಆಯ್ಕೆ ಮಾಡಿ
ml: നിറം തിരഞ്ഞെടുക്കുക
ta: நிறம் தேர்வு செய்யுங்கள்
te: రంగు ఎంపిక చేయండి

source: Hex Color
kn: ಹೆಕ್ಸ್ ಬಣ್ಣ
ml: ഹെക്സ കളർ
ta: ஹெக்ஸ் நிறம்
te: హెక్స్ రంగు

source: Type
kn: ಪ್ರಕಾರ
ml: തരം
ta: வகை
te: రకం

source: Amount
kn: ಮೊತ್ತ
ml: തുക
ta: தொகை
te: మొత్తం

source: From Account
kn: ಖಾತೆಯಿಂದ
ml: അക്കൗണ്ട് നൽകി
ta: கணக்கிலிருந்து
te: అకౌంటు నుండి

source: Category
kn: ವರ್ಗ
ml: വിഭാഗം
ta: வகை
te: వర్గం

source: To Account
kn: ಖಾತೆಗೆ
ml: അക്കൗണ്ടിലേക്ക്
ta: கணக்கில்
te: అకౌంటు కు

source: Note
kn: ಗಮನಿಸಿ
ml: കുറിപ്പ്
ta: குறிப்பு
te: గమనిక

source: Date
kn: ದಿನಾಂಕ
ml: തീയതി
ta: தேதி
te: తేది

source: Time
kn: ಸಮಯ
ml: സമയം
ta: நேரம்
te: సమయం

source: Transaction Details
kn: ಲಂಘನದ ವಿವರಗಳು
ml: ലംഘന വിവരങ്ങൾ
ta: பரிவர்த்தனை விவரங்கள்
te: లంఘన వివరాలు

source: Delete
kn: ಅಳಿಸಿ
ml: ഇല്ലാതാക്കുക
ta: நீக்கு
te: తొలగించు

source: Edit
kn: ಸಂಪಾದಿಸಿ
ml: തിരുത്തുക
ta: திருத்து
te: సవరించు

source: End of the list
kn: ಪಟ್ಟಿಯ ಕೊನೆ
ml: പട്ടികയുടെ അവസാനം
ta: பட்டியலின் முடிவு
te: జాబితా ముగింపు

source: More expense list
kn: ಹೆಚ್ಚು ಚೆಲವು ಪಟ್ಟಿ
ml: കൂടുതൽ ചിലവ് പട്ടിക
ta: மேலும் செலவு பட்டியல்
te: మరింత చెలవు జాబితా

source: Transactions
kn: ಲಂಘನೆಗಳು
ml: ലംഘനങ്ങൾ
ta: பரிவர்த்தனைகள்
te: లంఘనాలు

source: Net Balance
kn: ನೆಟ್ ಶೇಷ
ml: നെറ്റ് ബാലൻസ്
ta: நிகர சமம்
te: నెట్ బ్యాలెన్స్

source: Categories
kn: ವರ್ಗಗಳು
ml: വിഭാഗങ്ങൾ
ta: வகைகள்
te: వర్గాలు

source: Cancel
kn: ರದ್ದು ಮಾಡಿ
ml: റദ്ദാക്കുക
ta: ரத்து
te: రద్దు చేయండి

# select_date_and_time
source: Select Date & Time
kn: ದಿನಾಂಕ ಮತ್ತು ಸಮಯ ಆಯ್ಕೆ ಮಾಡಿ
ml: തീയതി കാലവും തിരഞ്ഞെടുക്കുക
ta: தேதி & நேரம் தேர்வு செய்யுங்கள்
te: తేదీ & సమయం ఎంచుకోండి

source: Today
kn: ಇಂದು
ml: ഇന്ന്
ta: இன்று
te: ఈ రోజు

source: Tomorrow
kn: ನಾಳೆ
ml: നാളെ
ta: நாளை
te: రేపు

source: Yesterday
kn: ನಿನ್ನೆ
ml: ഇന്നലെ
ta: நேற்று
te: నిన్న

source: Error
kn: ದೋಷ
ml: പിശക്
ta: பிழை
te: పొరపాటు

source: Success
kn: ಯಶಸ್ಸು
ml: വിജയം
ta: வெற்றி
te: విజయం

source: is empty
kn: ಖಾಲಿಯಾಗಿದೆ
ml: ശൂന്യം
ta: காலியாகுகிறது
te: ఖాళీగా ఉంది

source: Expense History
kn: ವೆಚ್ಚ ಇತಿಹಾಸ
ml: ചിലവ് ചരിത്രം
ta: செலவு வரலாறு
te: చెలవు చరిత్ర

source: This Week
kn: ಈ ವಾರ
ml: ഈ ആഴ്ച
ta: இந்த வாரம்
te: ఈ వారం

source: This Month
kn: ಈ ತಿಂಗಳು
ml: ഈ മാസം
ta: இந்த மாதம்
te: ఈ నెల

source: This Year
kn: ಈ ವರ್ಷ
ml: ഈ വർഷം
ta: இந்த ஆண்டு
te: ఈ సంవత్సరం

source: Older
kn: ಹಳೆಯದು
ml: പഴയത്
ta: பழையது
te: పాతవైనది

source: Current Month Balance
kn: ಪ್ರಸ್ತುತ ತಿಂಗಳ ಶೇಷ
ml: നിലവിലെ മാസത്തിന്റെ ബാലൻസ്
ta: தற்போதைய மாதம் நிலவு
te: ప్రస్తుత నెల శిశు

source: No Transaction Found
kn: ಲಂಘನೆ ಕಂಡುಬಂದಿಲ್ಲ
ml: ലംഘനം കണ്ടെത്താനായി സാധ്യതയില്ല
ta: பரிவர்த்தனை காணப்படவில்லை
te: లంఘన కనుగొనబడలేదు

source: Try Adding a transaction to see the list
kn: ಪಟ್ಟಿಯನ್ನು ನೋಡಲು ಲಂಘನೆಯನ್ನು ಸೇರಿಸಲು ಪ್ರಯತ್ನಿಸಿ
ml: പട്ടിക കാണാൻ ഒരു ലംഘനം ചേർക്കുക
ta: பட்டிகையைக் காண ஒரு பரிவர்த்தனையை சேர்க்கவும்
te: జాబితాను చూడడానికి ఒక లంఘనాన్ని జోడించండి

source: Delete All History
kn: ಎಲ್ಲಾ ಇತಿಹಾಸವನ್ನು ಅಳಿಸಬೇಕುತ?
ml: എല്ലാ ചരിത്രവും ഇല്ലാതാക്കുക
ta: முழு வரலாற்றை நீக்க வேண்டுமா?
te: మొత్తం చరిత్రను తొలగించాలా?

source: Do you want to delete the complete history?
kn: ಪೂರ್ಣ ಇತಿಹಾಸವನ್ನು ಅಳಿಸಬೇಕುತ?
ml: നിങ്ങൾ സമ്പൂർണ്ണ ചരിത്രവും ഇല്ലാതാക്കാൻ ആഗ്രഹിക്കുന്നുണ്ടോ?
ta: முழு வரலாற்றை நீக்க வேண்டுமா?
te: మొత్తం చరిత్రను తొలగించాలా?

source: No Data
kn: ಡೇಟಾ ಇಲ್ಲ
ml: ഡാറ്റ ഇല്ല
ta: தரவு இல்லை
te: డేటా లేదు

source: Try Adding an expense to see the graph
kn: ಗ್ರಾಫ್ ನೋಡಲು ಖರ್ಚು ಸೇರಿಸಲು ಪ್ರಯತ್ನಿಸಿ
ml: ഗ്രാഫ് കാണാൻ ഒരു ചിലവ് ചേർക്കുക
ta: கிராப் காண ஒரு செலவை சேர்க்கவும்
te: గ్రాఫ్ ను చూడడానికి ఒక చెలవును జోడించండి

source: Major Tools
kn: ಮುಖ್ಯ ಉಪಕರಣಗಳು
ml: പ്രധാന ഉപകരണങ്ങൾ
ta: முக்கிய கருவிகள்
te: ప్రధాన సాధనాలు

source: Translations
kn: ಅನುವಾದಗಳು
ml: അനുവാദങ്ങൾ
ta: மொழிபெயர்ப்புகள்
te: అనువాదాలు

# help_us_improve_our_translations_your_support_makes_big_deffierence
source: Help us improve our translations. Your support makes a big difference!
ta: எங்கள் மொழிபெயர்ப்புகளை மேம்படுத்த உதவுங்கள். உங்கள் ஆதரவு பெரும் பலன் கொள்கின்றது!
te: మా అనువాదాలను మెచ్చుకోవడానికి సహాయపడండి. మీ మద్దతు వెల్లడించుకుంది!

source: Contribute
kn: ಕೊಡುಗೆ
ml: അംഗങ്ങളാകുക
ta: பங்களிக்கவும்
te: సాహచర్యం

source: Press back again to exit
kn: ಹೊರಗೆ ಹೋಗಲು ಮತ್ತೆ ಹಿಂದಕ್ಕೆ ಒತ್ತಿರಿ
ml: പുറത്താക്കാൻ വീണ്ടും ബാക്ക് അമർത്തുക
ta: வெளியேற மீண்டும் பின் அழுத்தவும்
te: బయటకు వెళ్లడానికి మళ్లీ వెనక్కి నొక్కండి

source: Nick Name
kn: ಪರಿಚಯ
ml: അടയാളം
ta: அலைபேசி பெயர்
te: మారుపేరు

source: Username
kn: ಬಳಕೆದಾರ ಹೆಸರು
ml: ഉപയോക്തൃനാമം
ta: பயனர் பெயர்
te: వినియోగదారు పేరు

source: Enter Username
kn: ಬಳಕೆದಾರ ಹೆಸರು ನಮೂದಿಸಿ
ml: ഉപയോക്തൃനാമം നൽകുക
ta: பயனர் பெயர் உள்ளிடுக
te: వినియోగదారు పేరు నమోదు చేయండి

source: Username can't be empty
ta: பயனர் பெயர் காலியாக இருக்க முடியாது
te: వినియోగదారు పేరు ఖాళీగా ఉండకూడదు

source: Thanks for using this app
te: ఈ యాప్ ను ఉపయోగించినందుకు ధన్యవాదాలు

source: Hi
kn: ಹೈ
ml: ഹായ്
ta: வணக்கம்
te: హాయ్

source: Save
kn: ಉಳಿಸಿ
ml: സേവ്
ta: சேமிக்கவும்
te: సేవ్

source: Add an expense to this account for the selected period
ta: தேர்ந்தெடுக்கப்பட்ட காலக்கட்டத்திற்கான இந்தக் கணக்கில் செலவைச் சேர்க்கவும்
te: ఎంచుకున్న కాలం కోసం ఈ ఖాతాలో ఖర్చును జోడించండి

source: No Account
kn: ಖಾತೆ ಇಲ್ಲ
ml: അക്കൗണ്ട് ഇല്ല
ta: கணக்கு இல்லை
te: ఖాతా లేదు

source: Balance
kn: ಸಂತುಲನ
ml: ബാലൻസ്
ta: இருப்பு
te: బాలెన్స్

source: Account Details
kn: ಖಾತೆ ವಿವರಗಳು
ml: അക്കൗണ്ട് വിശദാംശങ്ങൾ
ta: கணக்கு விவரங்கள்
te: ఖాతా వివరాలు

source: Transaction Count
kn: ವಹಿವಾಟು ಎಣಿಕೆ
ml: ഇടപാട് എണ്ണം
ta: பரிவர்த்தனை எண்ணிக்கை
te: లావాదేవీ సంఖ్య

source: Account Name
kn: ಖಾತೆ ಹೆಸರು
ml: അക്കൗണ്ട് പേര്
ta: கணக்கு பெயர்
te: ఖాతా పేరు

source: Add Account
kn: ಖಾತೆ ಸೇರಿಸಿ
ml: അക്കൗണ്ട് ചേർക്കുക
ta: கணக்கு சேர்க்கவும்
te: ఖాతా జోడించండి

source: Edit Account
kn: ಖಾತೆಯನ್ನು ಸಂಪಾದಿಸಿ
ml: അക്കൗണ്ട് എഡിറ്റ് ചെയ്യുക
ta: கணக்கைத் திருத்து
te: ఖాతాను సవరించండి

source: Enter Account Name
kn: ಖಾತೆ ಹೆಸರು ನಮೂದಿಸಿ
ml: അക്കൗണ്ട് പേര് നൽകുക
ta: கணக்கு பெயர் உள்ளிடுக
te: ఖాతా పేరు నమోదు చేయండి

source: Account name already exists
ta: கணக்கு பெயர் ஏற்கனவே உள்ளது
te: ఖాతా పేరు ఇప్పటికే ఉంది

source: Account Name can't be empty
ta: கணக்கு பெயர் காலியாக இருக்க முடியாது
te: ఖాతా పేరు ఖాళీగా ఉండకూడదు

source: All entries to and from this account will also be deleted. Do you want to delete this account?
ta: இந்தக் கணக்குக்கான எல்லா பதிவுகளும் நீக்கப்படும். இந்தக் கணக்கை நீக்க விரும்புகிறீர்களா?
te: ఈ ఖాతా నుండి మరియు ఖాతాకు అన్ని ఎంట్రీలను కూడా తొలగిస్తారు. మీరు ఈ ఖాతాను తొలగించాలనుకుంటున్నారా?

source: Account deleted Successfully
kn: ಖಾತೆ ಯಶಸ್ವಿಯಾಗಿ ಅಳಿಸಲಾಗಿದೆ
ml: അക്കൗണ്ട് വിജയകരമായി നീക്കം ചെയ്തു
ta: கணக்கு வெற்றிகரமாக நீக்கப்பட்டது
te: ఖాతా విజయవంతంగా తొలగించబడింది

source: Delete this Account
ta: இந்தக் கணக்கை நீக்கவும்
te: ఈ ఖాతాను తొలగించండి

source: Category deleted Successfully
kn: ವರ್ಗ ಯಶಸ್ವಿಯಾಗಿ ಅಳಿಸಲಾಗಿದೆ
ml: വിഭാഗം വിജയകരമായി നീക്കം ചെയ്തു
ta: வகை வெற்றிகரமாக நீக்கப்பட்டது
te: వర్గం విజయవంతంగా తొలగించబడింది

source: Delete this Category
ta: இந்த வகையை நீக்கவும்
te: ఈ వర్గాన్ని తొలగించండి

source: Added Successfully
kn: ಯಶಸ್ವಿಯಾಗಿ ಸೇರಿಸಲಾಗಿದೆ
ml: വിജയകരമായി ചേർത്തു
ta: வெற்றிகரமாக சேர்க்கப்பட்டது
te: విజయవంతంగా జోడించబడింది

source: From Account and To Account can't be same
ta: இருப்பில் இருந்து கணக்கு மற்றும் கணக்கிற்கு ஒரே மாதிரியானது இருக்க முடியாது
te: ఖాతా నుండి ఖాతాకు ఒకే విధంగా ఉండకూడదు

source: Field is Empty
ta: புலம் காலியாக உள்ளது
te: ఫీల్డ్ ఖాళీగా ఉంది

source: Category Details
kn: ವರ್ಗ ವಿವರಗಳು
ml: വിഭാഗം വിശദാംശങ്ങൾ
ta: வகை விவரங்கள்
te: వర్గం వివరాలు

# delete_category_warning
source: All entries with this category will also be deleted. Do you want to delete this category?
kn: ಈ ವರ್ಗದಲ್ಲಿನ ಎಲ್ಲಾ ಪ್ರವೇಶಗಳನ್ನು ಕೂಡ ತೆಗೆದುಹಾಕಲಾಗುವುದು. ಈ ವರ್ಗವನ್ನು ಅಳಿಸಲು ಬಯಸುವಿರಾ?
ml: ഈ വിഭാഗത്തിലെ എല്ലാ എൻട്രികളും നീക്കും. ഈ വിഭാഗം നീക്കം ചെയ്യാൻ ആഗ്രഹിക്കുന്നു?
ta: இந்த வகையில் உள்ள எல்லா பதிவுகளும் நீக்கப்படும். இந்த வகையை நீக்க விரும்புகிறீர்களா?
te: ఈ వర్గంలో అన్ని ఎంట్రీలను కూడా తొలగిస్తారు. మీరు ఈ వర్గాన్ని తొలగించాలనుకుంటున్నారా?

# color_dark_mode_warning
source: This Color may affect visibility in dark mode
kn: ಈ ಬಣ್ಣ ಡಾರ್ಕ್ ಮೋಡ್‌ನಲ್ಲಿ ದೃಶ್ಯತೆಯನ್ನು ಪರಿಣಾಮ ಬೀರುತ್ತದೆ
ml: ഈ നിറം ഡാർക്ക് മോഡിൽ ദൃശ്യമാകും
ta: இந்த நிறம் இருள் நிலையில் காட்சியளிக்கலாம்
te: ఈ రంగు చీకటి మోడ్‌లో కనిపించవచ్చు

# color_light_mode_warning
source: This Color may affect visibility in light mode
kn: ಈ ಬಣ್ಣ ಲೈಟ್ ಮೋಡ್‌ನಲ್ಲಿ ದೃಶ್ಯತೆಯನ್ನು ಪರಿಣಾಮ ಬೀರುತ್ತದೆ
ml: ഈ നിറം ലൈറ്റ് മോഡിൽ ദൃശ്യമാകും
ta: இந்த நிறம் ஒளி நிலையில் காட்சியளிக்கலாம்
te: ఈ రంగు లైట్ మోడ్‌లో కనిపించవచ్చు

# add_expense_now_reminder
source: Don't miss outâ€”add your expense now!
kn: ಕಳೆಯಬೇಡಿ—ಈಗಲೇ ನಿಮ್ಮ ವೆಚ್ಚವನ್ನು ಸೇರಿಸಿ!
ml: കാഴ്‌ച കാണരുത്—ഇപ്പോൾ നിങ്ങളുടെ ചെലവ് ചേർക്കുക!
ta: மிஸ் செய்ய வேண்டாம்—உங்கள் செலவுகளை இப்போது சேர்க்கவும்!
te: మిస్సవద్దు—ఇప్పుడే మీ ఖర్చును జోడించండి!

source: Import Data
kn: ಡೇಟಾವನ್ನು ಆಮದುಮಾಡಿ
ml: ഡാറ്റ ഇമ്പോർട്ട് ചെയ്യുക
ta: தரவை இறக்குமதி செய்க
te: డేటాను దిగుమతి చేయండి

# download_template_excel
source: Download the template Excel
kn: ಟೆಂಪ್ಲೇಟ್ ಎಕ್ಸೆಲ್ ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ
ml: ടെംപ്ലേറ്റ് എക്സൽ ഡൗൺലോഡ് ചെയ്യുക
ta: வார்ப்புரு எக்செல் பதிவிறக்கவும்
te: టెంప్లేట్ ఎక్సెల్ డౌన్‌లోడ్ చేయండి

# only_xlsx_file_format_supported
source: Only .xlsx file format is supported.
kn: ಕೇವಲ .xlsx ಫೈಲ್ ಸ್ವರೂಪವನ್ನು ಬೆಂಬಲಿಸುತ್ತದೆ.
ml: കേവലം .xlsx ഫയൽ ഫോർമാറ്റ് പിന്തുണയ്ക്കുന്നു.
ta: சிறந்த .xlsx கோப்பு வடிவமைப்பு ஆதரிக்கப்படுகிறது.
te: కేవలం .xlsx ఫైల్ ఫార్మాట్ మాత్రమే మద్దతు ఇస్తుంది.

source: Values are case sensitive.
kn: ಮೌಲ್ಯಗಳು ಕೇಸ್ ಸೆನ್ಸಿಟಿವ್ ಆಗಿವೆ.
ml: മൂല്യങ്ങൾ കേസിന്റെ അനുഭവവശത്തേക്ക് സങ്കേതമാണ്.
ta: மதிப்புகள் கேஸ் சென்சிடிவ் ஆகும்.
te: విలువలు కేస్ సెన్సిటివ్‌గా ఉంటాయి.

# errors_will_cause_entries_to_be_skipped
source: Errors will cause those entries to be skipped.
kn: ದೋಷಗಳು ಆ ನಮೂದುಗಳನ್ನು ತಿರಸ್ಕರಿಸುತ್ತವೆ.
ml: പിശകുകൾ മൂലം ആ എൻട്രികൾ ഒഴിവാക്കപ്പെടും.
ta: பிழைகள் அந்த பதிவுகளை தவிர்க்கும்.
te: పదాలు పక్షము మరియు తప్పులు ఈ ఎంట్రీలను దాటిస్తాయి.

# possible_values_are_expense_income_transfer
source: Possible values: "Expense", "Income", "Transfer".
kn: ಸಾಧ್ಯವಿರುವ ಮೌಲ್ಯಗಳು: "Expense", "Income", "Transfer".
ml: സാധ്യമായ മൂല്യങ്ങൾ: "Expense", "Income", "Transfer".
ta: சாத்தியமான மதிப்புகள்: "Expense", "Income", "Transfer".
te: సంభావ్య విలువలు: "Expense", "Income", "Transfer".

# for_transfer_toaccount_in_category_column
source: For "Transfer", the ToAccount value can be written in category column.
kn: "Transfer"ಗಾಗಿ, ToAccount ಮೌಲ್ಯವನ್ನು ವರ್ಗ ಹಾದಿಯಲ್ಲಿ ಬರೆಯಬಹುದು.
ml: "Transfer"-ക്കായി, ToAccount മൂല്യം കാറ്റഗറി കോളത്തിൽ എഴുതാം.
ta: "Transfer" க்கு, ToAccount மதிப்பை வகை பத்தியில் எழுதலாம்.
te: "Transfer" కోసం, ToAccount విలువను కేటగిరీ కాలమ్‌లో రాయవచ్చు.

# should_be_a_double_type_example_10_0
source: Should be a double type, e.g., "10.0".
kn: ಡಬಲ್ ಟೈಪ್ ಆಗಿರಬೇಕು, ಉದಾಹರಣೆಗೆ, "10.0".
ml: ഒരു ഡബിൾ ടൈപ്പാകണം, ഉദാഹരണത്തിന്, "10.0".
ta: ஒரு டபுள் வகையாக இருக்க வேண்டும், உதாரணமாக, "10.0".
te: డబుల్ టైప్‌గా ఉండాలి, ఉదాహరణకు, "10.0".

# must_be_in_account_list_or_new_account_created
source: Must be in Account List, else new account will be created.
kn: ಖಾತೆ ಪಟ್ಟಿಯಲ್ಲಿರಬೇಕು ಅಥವಾ ಹೊಸ ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಲಾಗುತ್ತದೆ.
ml: അക്കൗണ്ട് ലിസ്റ്റിൽ ഉണ്ടായിരിക്കണം, അല്ലെങ്കിൽ പുതിയ അക്കൗണ്ട് സൃഷ്ടിക്കും.
ta: கணக்கு பட்டியலில் இருக்க வேண்டும் அல்லது புதிய கணக்கு உருவாக்கப்படும்.
te: ఖాతా జాబితాలో ఉండాలి లేదా కొత్త ఖాతా సృష్టించబడుతుంది.

# for_expense_income_category_for_transfer_toaccount
source: For "Expense" and "Income", this is the category. For "Transfer", it is the ToAccount. New categories or accounts will be created if not present.
kn: "Expense" ಮತ್ತು "Income"ಗಾಗಿ, ಇದು ವರ್ಗವಾಗಿದೆ. "Transfer"ಗಾಗಿ, ಇದು ToAccount ಆಗಿದೆ. ಹೊಸ ವರ್ಗಗಳು ಅಥವಾ ಖಾತೆಗಳು ಇಲ್ಲದಿದ್ದರೆ ಸೃಷ್ಟಿಸಲಾಗುತ್ತದೆ.
ml: "Expense" കൂടാതെ "Income" നുള്ളത്, ഇത് കാറ്റഗറിയാണ്. "Transfer"-ക്കായി, ഇത് ToAccount ആണ്. പുതിയ കാറ്റഗറികൾ അല്ലെങ്കിൽ അക്കൗണ്ടുകൾ ഇല്ലെങ്കിൽ സൃഷ്ടിക്കും.
ta: "Expense" மற்றும் "Income" க்கு, இது வகையாகும். "Transfer" க்கு, இது ToAccount ஆகும். புதிய வகைகள் அல்லது கணக்குகள் இல்லையென்றால் உருவாக்கப்படும்.
te: "Expense" మరియు "Income" కోసం, ఇది కేటగిరీ. "Transfer" కోసం, ఇది ToAccount. కొత్త కేటగిరీలు లేదా ఖాతాలు లేనప్పుడు సృష్టించబడతాయి.

# any_value_is_accepted
source: Any value.
kn: ಯಾವುದೇ ಮೌಲ್ಯವನ್ನು ಒಪ್ಪಿಕೊಳ್ಳಲಾಗುತ್ತದೆ.
ml: ഏതെങ്കിലും മൂല്യം സ്വീകരിക്കും.
ta: எந்த மதிப்பும் ஏற்கப்படும்.
te: ఏ విలువ కూడా ఆమోదించబడుతుంది.

# date_format_is_yyyy_mm_dd
source: Format: yyyy-mm-dd.
kn: ಸ್ವರೂಪ: yyyy-mm-dd.
ml: ഫോർമാറ്റ്: yyyy-mm-dd.
ta: வடிவமைப்பு: yyyy-mm-dd.
te: ఫార్మాట్: yyyy-mm-dd.

# excel_date_formatting_issue_fix
source: If Excel is autoformating value into another date format, select all date cells -> Click on format -> Text.
kn: ಎಕ್ಸೆಲ್ ದಿನಾಂಕ ಮೌಲ್ಯವನ್ನು ಮತ್ತೊಂದು ದಿನಾಂಕ ಸ್ವರೂಪಕ್ಕೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಸ್ವರೂಪಿಸದಿದ್ದರೆ, ಎಲ್ಲಾ ದಿನಾಂಕ ಕೋಷ್ಠಕಗಳನ್ನು ಆರಿಸಿ -> ಸ್ವರೂಪದಲ್ಲಿ ಕ್ಲಿಕ್ ಮಾಡಿ -> ಪಠ್ಯ.
ml: എക്സെൽ തീയതി മൂല്യത്തെ മറ്റൊരു തീയതി ഫോർമാറ്റിലേക്ക് ഓട്ടോമാറ്റിക്കായി ഫോർമാറ്റ് ചെയ്യുന്നുണ്ടെങ്കിൽ, എല്ലാ തീയതി കോഷുകളും തിരഞ്ഞെടുക്കുക -> ഫോർമാറ്റിൽ ക്ലിക്കുചെയ്യുക -> ടെക്സ്റ്റ്.
ta: எக்ஸெல் திகதி மதிப்பை வேறு ஒரு திகதி வடிவத்தில் தானாக வடிவமைக்கின்றால், அனைத்து திகதி செறிவுகளையும் தேர்ந்தெடுக்கவும் -> வடிவமைப்பில் கிளிக் செய்யவும் -> உரை.
te: ఎక్సెల్ డేట్ విలువను మరొక డేట్ ఫార్మాట్‌లో ఆటోమేటిక్‌గా ఫార్మాట్ చేస్తే, అన్ని డేట్ సెల్‌లను ఎంచుకోండి -> ఫార్మాట్‌లో క్లిక్ చేయండి -> టెక్స్ట్.

# time_format_is_hh_mm_24hr
source: Format: hh:mm (24hr).
kn: ಸ್ವರೂಪ: hh:mm (24hr).
ml: ഫോർമാറ്റ്: hh:mm (24hr).
ta: வடிவமைப்பு: hh:mm (24hr).
te: ఫార్మాట్: hh:mm (24hr).

# confirm_import_button
source: Confirm Import
kn: ಆಮದು ದೃಢೀಕರಿಸಿ
ml: ഇമ്പോർട്ട് സ്ഥിരീകരിക്കുക
ta: இறக்குமதி உறுதிப்படுத்தவும்
te: ఇంపోర్ట్‌ను నిర్ధారించండి

# summary_section
source: Summary
kn: ಸಾರಾಂಶ
ml: സംഗ്രഹം
ta: சுருக்கம்
te: సారాంశం

# total_entries_label
source: Total Entries
kn: ಒಟ್ಟು ನಮೂದುಗಳು
ml: മൊത്തം എൻട്രികൾ
ta: மொத்த பதிவுகள்
te: మొత్తం ఎంట్రీలు

# valid_entries_label
source: Valid Entries
kn: ಮಾನ್ಯ ನಮೂದುಗಳು
ml: സാധുവായ എൻട്രികൾ
ta: சரியான பதிவுகள்
te: సరైన ఎంట్రీలు

# invalid_entries_label
source: Invalid Entries
kn: ಅಮಾನ್ಯ ನಮೂದುಗಳು
ml: അസാധുവായ എൻട്രികൾ
ta: தவறான பதிவுகள்
te: తప్పు ఎంట్రీలు

# transfers_section
source: Transfers
kn: ಹಸ್ತಾಂತರಗಳು
ml: ട്രാൻസ്ഫറുകൾ
ta: மாற்றங்கள்
te: మార్పిడి

# export_data_button
source: Export Data
kn: ಡೇಟಾ ರಫ್ತು ಮಾಡಿ
ml: ഡാറ്റാ എക്സ്പോർട്ട്
ta: தரவை ஏற்றுமதி செய்யவும்
te: డేటాను ఎగుమతి చేయండి

# download_button
source: Download
kn: ಡೌನ್‌ಲೋಡ್
ml: ഡൗൺലോഡ്
ta: பதிவிறக்க
te: డౌన్లోడ్

source: Download your data in Excel format
kn: ನಿಮ್ಮ ಡೇಟಾವನ್ನು ಎಕ್ಸೆಲ್ ಸ್ವರೂಪದಲ್ಲಿ ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ
ml: നിങ്ങളുടെ ഡാറ്റ എക്സൽ ഫോർമാറ്റിൽ ഡൗൺലോഡ് ചെയ്യുക
ta: உங்கள் தரவை எக்ஸெல் வடிவத்தில் பதிவிறக்கவும்
te: మీ డేటాను ఎక్సెల్ ఫార్మాట్‌లో డౌన్లోడ్ చేయండి

# upload_data_from_excel_file
source: Upload data from an Excel file
kn: ಎಕ್ಸೆಲ್ ಫೈಲ್‌ನಿಂದ ಡೇಟಾವನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ
ml: എക്സൽ ഫയലിൽ നിന്ന് ഡാറ്റ അപ്ലോഡ് ചെയ്യുക
ta: எக்ஸெல் கோப்பிலிருந்து தரவை பதிவேற்றவும்
te: ఎక్సెల్ ఫైల్ నుండి డేటాను అప్లోడ్ చేయండి

# error_picking_file_message
source: Error picking file
kn: ಫೈಲ್ ಆಯ್ಕೆ ಮಾಡುವಲ್ಲಿ ದೋಷ
ml: ഫയൽ തിരഞ്ഞെടുക്കുന്നതിൽ പിശക്
ta: கோப்பை தேர்வதில் பிழை
te: ఫైల్ ఎంపికలో తప్పు

# invalid_number_of_columns_message
source: Invalid number of columns
kn: ಅಮಾನ್ಯ ಕಂಬಿಗಳ ಸಂಖ್ಯೆ
ml: അസാധുവായ കോളം എണ്ണം
ta: தவறான நெடுவரிசைகள் எண்ணிக்கை
te: తప్పు కాలమ్ సంఖ్య
