Repository: NeriQuest/ExpenseMate-App-translations
Catalog: l10n/app_*.arb
Languages: kn, ml, ta, te

# invalid_header_check_spelling_mistakes
source: Invalid header. Check if any spelling mistakes are there
kn: ಅಮಾನ್ಯ ಶೀರ್ಷಿಕೆ. ಯಾವುದೇ ಅಕ್ಷರದ ದೋಷಗಳಿವೆಯೇ ಎಂದು ಪರಿಶೀಲಿಸಿ
ml: അസാധുവായ ഹെഡർ. ഏതെങ്കിലും ശബ്ദ പിശകുകൾ ഉണ്ടോ എന്ന് പരിശോധിക്കുക
ta: தவறான தலைப்பு. எவ்வித எழுத்துப் பிழைகள் உள்ளனவா என சரிபார்க்கவும்
te: తప్పు హెడర్. వ్రాతపెద్దలలో ఏదైనా వ్రాతపెద్దలున్నాయా అనేది తనిఖీ చేయండి

# error_in_row_message
source: Error in row
kn: ಸಾಲಿನಲ್ಲಿ ದೋಷ
ml: ശ്രീരത്തിൽ പിശക്
ta: வரியில் பிழை
te: వరుసలో తప్పు

source: Type is required and cannot be empty
kn: ಪ್ರಕಾರ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾಲಿ ಇರಬಾರದು
ml: ടൈപ്പ് ആവശ്യമാണ് കൂടാതെ ഒഴിഞ്ഞിരിക്കരുത്
ta: வகை தேவை மற்றும் காலியாக இருக்க முடியாது
te: రకం అవసరం మరియు ఖాళీగా ఉండకూడదు

# amount_is_required_and_must_be_valid_number
source: Amount is required and must be a valid number
kn: ಮೊತ್ತ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಮಾನ್ಯ ಸಂಖ್ಯೆಯಾಗಿರಬೇಕು
ml: അളവ് ആവശ്യമാണ് കൂടാതെ ഒരു സാധുവായ നമ്പർ ആയിരിക്കണം
ta: அளவு தேவை மற்றும் சரியான எண்ணாக இருக்க வேண்டும்
te: మొత్తం అవసరం మరియు సరైన సంఖ్య కావాలి

source: FromAccount is required and cannot be empty
kn: FromAccount ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾಲಿ ಇರಬಾರದು
ml: FromAccount ആവശ്യമാണ് കൂടാതെ ഒഴിഞ്ഞിരിക്കരുത്
ta: FromAccount தேவை மற்றும் காலியாக இருக்க முடியாது
te: FromAccount అవసరం మరియు ఖాళీగా ఉండకూడదు

source: Category is required and cannot be empty
kn: ವರ್ಗ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾಲಿ ಇರಬಾರದು
ml: കാറ്റഗറി ആവശ്യമാണ് കൂടാതെ ഒഴിഞ്ഞിരിക്കരുത്
ta: வகை தேவை மற்றும் காலியாக இருக்க முடியாது
te: కేటగిరీ అవసరం మరియు ఖాళీగా ఉండకూడదు

source: Date is required and cannot be empty
kn: ದಿನಾಂಕ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾಲಿ ಇರಬಾರದು
ml: തീയതി ആവശ്യമാണ് കൂടാതെ ഒഴിഞ്ഞിരിക്കരുത്
ta: தேதி தேவை மற்றும் காலியாக இருக்க முடியாது
te: తేదీ అవసరం మరియు ఖాళీగా ఉండకూడదు

source: Time is required and cannot be empty
kn: ಸಮಯ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾಲಿ ಇರಬಾರದು
ml: സമയം ആവശ്യമാണ് കൂടാതെ ഒഴിഞ്ഞിരിക്കരുത്
ta: நேரம் தேவை மற்றும் காலியாக இருக்க முடியாது
te: సమయం అవసరం మరియు ఖాళీగా ఉండకూడదు

# invalid_type_value_ensure_income_expense_transfer
source: Invalid type value. Ensure its either "Income" or "Expense" or "Transfer".
kn: ಅಮಾನ್ಯ ಪ್ರಕಾರ ಮೌಲ್ಯ. ಇದು "Income" ಅಥವಾ "Expense" ಅಥವಾ "Transfer" ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
ml: അസാധുവായ ടൈപ്പ് മൂല്യം. ഇത് "Income" അല്ലെങ്കിൽ "Expense" അല്ലെങ്കിൽ "Transfer" ആയിരിക്കുമെന്ന് ഉറപ്പാക്കുക.
ta: தவறான வகை மதிப்பு. இது "Income" அல்லது "Expense" அல்லது "Transfer" என்று உறுதிப்படுத்தவும்.
te: తప్పు రకం విలువ. ఇది "Income" లేదా "Expense" లేదా "Transfer" అని నిర్ధారించండి.

# invalid_date_format_message
source: Invalid date format.
kn: ಅಮಾನ್ಯ ದಿನಾಂಕ ಸ್ವರೂಪ.
ml: അസാധുവായ തീയതി ഫോർമാറ്റ്.
ta: தவறான திகதி வடிவமைப்பு.
te: తప్పు తేదీ ఫార్మాట్.

# invalid_date_format_correct_is_yyyy_mm_dd
source: Invalid date format. Correct format is: yyyy-mm-dd
kn: ಅಮಾನ್ಯ ದಿನಾಂಕ ಸ್ವರೂಪ. ಸರಿಯಾದ ಸ್ವರೂಪ: yyyy-mm-dd
ml: അസാധുവായ തീയതി ഫോർമാറ്റ്. ശരിയായ ഫോർമാറ്റ്: yyyy-mm-dd
ta: தவறான திகதி வடிவமைப்பு. சரியான வடிவமைப்பு: yyyy-mm-dd
te: తప్పు తేదీ ఫార్మాట్. సరైన ఫార్మాట్: yyyy-mm-dd

# invalid_date_value_correct_format_is_yyyy_mm_dd
source: Invalid date value. Ensure its a valid date with yyyy-mm-dd format.
kn: ಅಮಾನ್ಯ ದಿನಾಂಕ ಮೌಲ್ಯ. ಇದು yyyy-mm-dd ಸ್ವರೂಪದಲ್ಲಿ ಮಾನ್ಯ ದಿನಾಂಕ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
ml: അസാധുവായ തീയതി മൂല്യം. ഇത് yyyy-mm-dd ഫോർമാറ്റിൽ ഒരു സാധുവായ തീയതി ആണെന്ന് ഉറപ്പാക്കുക.
ta: தவறான திகதி மதிப்பு. இது yyyy-mm-dd வடிவத்தில் சரியான திகதி என உறுதிப்படுத்தவும்.
te: తప్పు తేదీ విలువ. ఇది yyyy-mm-dd ఫార్మాట్‌లో సరైన తేదీ అని నిర్ధారించండి.

# invalid_time_format_message
source: Invalid time format
kn: ಅಮಾನ್ಯ ಸಮಯ ಸ್ವರೂಪ
ml: അസാധുവായ സമയം ഫോർമാറ്റ്
ta: தவறான நேரம் வடிவமைப்பு
te: తప్పు సమయం ఫార్మాట్

# invalid_time_format_correct_is_hh_mm
source: Invalid time format. hh:mm is the correct time format.
kn: ಅಮಾನ್ಯ ಸಮಯ ಸ್ವರೂಪ. ಸರಿಯಾದ ಸಮಯ ಸ್ವರೂಪ: hh:mm
ml: അസാധുവായ സമയം ഫോർമാറ്റ്. ശരിയായ സമയം ഫോർമാറ്റ്: hh:mm
ta: தவறான நேரம் வடிவமைப்பு. சரியான நேரம் வடிவமைப்பு: hh:mm
te: తప్పు సమయం ఫార్మాట్. సరైన సమయం ఫార్మాట్: hh:mm

# invalid_time_value_ensure_valid_24hr_format
source: Invalid time value. Please ensure it is in a valid 24 hour format(hh:mm).
kn: ಅಮಾನ್ಯ ಸಮಯ ಮೌಲ್ಯ. ದಯವಿಟ್ಟು ಇದು ಮಾನ್ಯ 24 ಗಂಟೆಯ ಸ್ವರೂಪದಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ (hh:mm).
ml: അസാധുവായ സമയം മൂല്യം. ദയവായി ഉറപ്പാക്കുക ഇത് ഒരു സാധുവായ 24 മണിക്കൂർ ഫോർമാറ്റിൽ ആണ് (hh:mm).
ta: தவறான நேரம் மதிப்பு. இது சரியான 24 மணி நேர வடிவத்தில் இருக்கின்றது என்று உறுதிப்படுத்தவும் (hh:mm).
te: తప్పు సమయం విలువ. ఇది సరైన 24 గంటల ఫార్మాట్‌లో ఉందని నిర్ధారించండి (hh:mm).

# warning_in_row_message
source: Warning in row
kn: ಸಾಲಿನಲ್ಲಿ ಎಚ್ಚರಿಕೆ
ml: ശ്രീരത്തിൽ മുന്നറിയിപ്പ്
ta: வரியில் எச்சரிக்கை
te: వరుసలో హెచ్చరిక

# doesnt_exist_message
source: doesn't exists
kn: ಇಲ್ಲ
ml: ഇല്ല
ta: இல்லை
te: లేద

# new_category_will_be_created
source: Hence new Category will be created.
kn: ಆದಕಾರಣ ಹೊಸ ವರ್ಗವನ್ನು ಸೃಷ್ಟಿಸಲಾಗುತ್ತದೆ.
ml: അതിനാൽ പുതിയ കാറ്റഗറി സൃഷ്ടിക്കും.
ta: அதனால் புதிய வகை உருவாக்கப்படும்.
te: కాబట్టి కొత్త కేటగిరీ సృష్టించబడుతుంది.

# new_account_will_be_created
source: Hence new Account will be created.
kn: ಆದಕಾರಣ ಹೊಸ ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಲಾಗುತ್ತದೆ.
ml: അതിനാൽ പുതിയ അക്കൗണ്ട് സൃഷ്ടിക്കും.
ta: அதனால் புதிய கணக்கு உருவாக்கப்படும்.
te: కాబట్టి కొత్త ఖాతా సృష్టించబడుతుంది.

source: Transfer
te: మార్పు

source: Do you want to delete the entire data ?
te: మీరు మొత్తం డేటా ను తొలగించాలనుకుంటున్నారా?

source: Delete all Data
te: అన్ని డేటా ను తొలగించండి

source: Add Category
te: వర్గం జోడించండి

source: Category Name
te: వర్గం పేరు

source: Category already exists
te: వర్గం ఇప్పటికే ఉన్నది

source: Monthly Expense Limit
te: మాసిక ఖర్చు పరిమితి

source: Select Icon
te: చిహ్నాన్ని ఎంచుకోండి

source: Category Added Successfully
te: వర్గం విజయవంతంగా జోడించబడింది

source: Category saved Successfully
te: వర్గం విజయవంతంగా సేవ్ చేయబడింది

source: Category name is empty
te: వర్గం పేరు ఖాళీగా ఉంది

source: All entries with this category will also be deleted.
te: ఈ వర్గం తో అన్నీ కూడా తొలగించబడతాయి.

source: Do you want to delete this category ?
te: మీరు ఈ వర్గం ను తొలగించాలనుకుంటున్నారా?

source: Icon
te: చిహ్నం

source: Monthly Limit
te: మాసిక పరిమితి

source: Per Day Limit
te: ప్రతి రోజు పరిమితి

source: Sort by
te: సార్టు ద్వారా

source: Filter
te: ఫిల్టర్

source: Threshold Amount
te: థ్రెషోల్డ్ మొత్తం

source: Clear
te: తొలగించు

source: Sorted By Amount
te: మొత్తం ద్వారా సార్టు చేయబడింది

source: From
te: నుంచి

source: To
te: వరకు

source: All entries to and from this account will also be deleted.
te: ఈ ఖాతాకు సంబంధించిన అన్ని ఎంట్రీలు కూడా తొలగించబడతాయి.

source: monthly limit already spent
te: మాసిక పరిమితి ఇప్పటికే ఖర్చు అయింది

source: Hex Value
te: హెక్స్వాల్యూ

source: Dates
te: తేదీలు

source: WeekDays
te: ఆప్తదినాలు

source: Delete this transaction from the database ?
te: ఈ లావాదేవీని డేటాబేస్ నుండి తొలగించాలనుకుంటున్నారా?

source: Delete this transaction
te: ఈ లావాదేవీని తొలగించండి

source: Edit Expense
te: ఖర్చు సవరించు

source: Updated Successfully
te: విజయవంతంగా నవీకరించబడింది

source: deleted Successfully
te: విజయవంతంగా తొలగించబడింది

source: Not a valid amount value
te: సరైన మొత్తం విలువ కాదు

source: Do you want to delete this account ?
te: మీరు ఈ ఖాతాను తొలగించాలనుకుంటున్నారా?

source: All data deleted successfully
te: అన్ని డేటా విజయవంతంగా తొలగించబడింది

source: Delete all data, accounts, categories
te: అన్ని డేటా, ఖాతాలు, వర్గాలు తొలగించండి

source: Link
te: లింక్

source: Monthly expense amount
te: మాసిక ఖర్చు మొత్తం

source: Update
te: అప్డేట్

source: Edit account name
te: ఖాతా పేరు సంపాదించండి

source: Try adding an expense to this account for the selected period
te: ఎంచుకున్న కాలానికి ఈ ఖాతాకు ఒక ఖర్చు జోడించడానికి ప్రయత్నించండి

source: Excel file saved to
te: ఎక్సెల్ ఫైల్ సేవ్ చేయబడింది

source: Data format
te: డేటా ఫార్మాట్

source: Before import
te: ఆయాత్మత్ ముందు

source: Entries added to the database
te: డేటాబేస్‌కు ప్రవేశాలు జోడించబడ్డాయి

source: Hello
te: హలో

source: Hi there
te: హలో

source: How are you
te: మీరు ఎలా ఉన్నారు

source: What's up
te: ఏం జరుగుతోంది

source: Hello there
te: హలో

source: Hope all is well
te: అందరికీ బాగున్నట్లు ఆశిస్తున్నాను

source: Good day
te: శుభోదయం

source: Good morning
te: శుభోదయం

source: Good afternoon
te: శుభమధ్యాహ్నం

source: Good evening
te: శుభసంధ్య

source: Good night
te: శుభరాత్రి

source: Get some rest
te: చేసుకోండి
